---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotChangeExtension
source: html/3b31273c-bcf8-818c-62ca-7761e2e8c27f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.PinnedFabricationPartNotChangeExtension Property

Failed to change extension of part.

## Syntax (C#)
```csharp
public static FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; }
```